
LoggerHeadDB = {
["profileKeys"] = {
["Beamladen - Twisting Nether"] = "Default",
["Мальдика - Свежеватель Душ"] = "Default",
["Сэйвмэн - Свежеватель Душ"] = "Default",
["Пва - Свежеватель Душ"] = "Default",
["Вантачмэн - Ревущий фьорд"] = "Default",
["Дракобес - Свежеватель Душ"] = "Default",
["Спленда - Свежеватель Душ"] = "Default",
["Вольтчара - Свежеватель Душ"] = "Default",
["Топмэн - Свежеватель Душ"] = "Default",
["Garrettino - Aegwynn"] = "Default",
["Алианкано - Свежеватель Душ"] = "Default",
["Джуставар - Свежеватель Душ"] = "Default",
["Сорчистино - Свежеватель Душ"] = "Default",
["Виандисто - Свежеватель Душ"] = "Default",
["Бимладен - Ревущий фьорд"] = "Default",
["Прециза - Свежеватель Душ"] = "Default",
},
["profiles"] = {
["Default"] = {
["log"] = {
["party"] = {
["Кузня Душ"] = {
[24] = false,
},
["Врата Заходящего Солнца"] = {
[24] = false,
},
["Цитадель Адского Пламени: Кузня Крови"] = {
[24] = false,
},
["Туманы Тирна Скитта"] = {
false,
false,
[23] = false,
[8] = false,
},
["\"Сияющий Рассвет\""] = {
false,
false,
[8] = false,
[23] = false,
},
["Квартал Звезд"] = {
[24] = false,
},
["Вечное Цветение"] = {
[24] = false,
},
["Хмелеварня Буйных Портеров"] = {
[24] = false,
},
["Театр Боли"] = {
false,
[8] = false,
[23] = false,
},
["Мертвые копи"] = {
[24] = false,
},
["Ара-Кара, Город Отголосков"] = {
false,
false,
[23] = false,
[8] = false,
},
["Кривой Клык: Нижетопь"] = {
[24] = false,
},
["Атал'Дазар"] = {
[24] = false,
},
["Смертельная тризна"] = {
false,
false,
[23] = false,
[8] = false,
},
["Забытый город"] = {
[24] = false,
},
["Заповедник \"Аль'дани\""] = {
false,
false,
[23] = false,
[8] = false,
},
["Гнездовье"] = {
false,
false,
[8] = false,
[23] = false,
},
["Чертоги Покаяния"] = {
false,
false,
[23] = false,
[8] = false,
},
["ЗОЛОТАЯ ЖИЛА!!!"] = {
false,
[23] = false,
[8] = false,
},
["Усадьба Уэйкрестов"] = {
[24] = false,
},
["Операция \"Мехагон\""] = {
[23] = false,
[8] = false,
},
["Небесный Путь"] = {
[24] = false,
},
["Храм Нефритовой Змеи"] = {
[24] = false,
},
["Святилище Штормов"] = {
[24] = false,
},
["Азжол-Неруб"] = {
[24] = false,
},
["Чертоги Молний"] = {
[24] = false,
},
["Город Нитей"] = {
false,
false,
[8] = false,
[23] = false,
},
["Академия Алгет'ар"] = {
false,
},
["Гробница королей"] = {
[24] = false,
},
["Стратхольм"] = {
[24] = false,
},
["Зул'Фаррак"] = {
[24] = false,
},
["Монастырь Шадо-Пан"] = {
[24] = false,
},
["Операция: шлюз"] = {
false,
false,
[23] = false,
[8] = false,
},
["Вольная Гавань"] = {
[24] = false,
},
["Осада Боралуса"] = {
false,
[8] = false,
[23] = false,
},
["Каменный Свод"] = {
false,
false,
[8] = false,
[23] = false,
},
["Грим Батол"] = {
false,
false,
[23] = false,
[8] = false,
},
["Шлаковые шахты Кровавого Молота"] = {
[24] = false,
},
["Искроварня"] = {
false,
[8] = false,
[23] = false,
},
["Крепость Бурь: Ботаника"] = {
[24] = false,
},
["Расселина Темного Пламени"] = {
false,
false,
[8] = false,
[23] = false,
},
["Казематы Стражей"] = {
[24] = false,
},
["Цитадель Адского Пламени: Разрушенные залы"] = {
[24] = false,
},
["Приорат Священного Пламени"] = {
false,
false,
[23] = false,
[8] = false,
},
["Нексус"] = {
[24] = false,
},
["Тайный рынок Тазавеш"] = {
[8] = false,
[2] = false,
[23] = false,
},
["Аукиндон: Гробницы маны"] = {
[24] = false,
},
["Око Азшары"] = {
[24] = false,
},
["Чаща Темного Сердца"] = {
[24] = false,
},
["Храм Сетралисс"] = {
[24] = false,
},
["Аукиндон"] = {
[24] = false,
},
},
["scenario"] = {
["Грибные гадости"] = {
[208] = false,
},
["Шахты Землескребов"] = {
[208] = false,
},
["Место раскопок 9"] = {
[208] = false,
},
["Святыня Сумерек"] = {
[208] = false,
},
["Переулочный шлюз"] = {
[208] = false,
},
["Глубины Так-Ретана"] = {
[208] = false,
},
["Убежище рассекателя Бездны"] = {
[208] = false,
},
["Сплетенная Спираль"] = {
[208] = false,
},
["Покой Кригвала"] = {
[208] = false,
},
["Снующий пролом"] = {
[208] = false,
},
},
["raid"] = {
["Ульдуар"] = {
[24] = false,
[14] = false,
},
["Освобождение Нижней Шахты"] = {
[14] = false,
[16] = false,
[17] = false,
[15] = false,
},
["Манагорн Омега"] = {
[14] = false,
[16] = true,
[17] = false,
[15] = false,
},
["Неруб'арский дворец"] = {
[14] = false,
[16] = false,
[15] = false,
[17] = false,
},
},
},
["version"] = 3,
["chat"] = true,
["minimap"] = {
["hide"] = true,
},
},
},
}
