    function (self, unitId, unitFrame, envTable, modTable)

        local markerToHex = {
            [1] = "FFEAEA0D", -- Yellow 5 Point Star
            [2] = "FFEAB10D", -- Orange Circle
            [3] = "FFCD00FF", -- Purple Diamond
            [4] = "FF06D425", -- Green Triangle
            [5] = "FFB3E3D8", -- Light Blue Moon
            [6] = "FF0CD2EA", -- Blue Square
            [7] = "FFD6210B", -- Red Cross
            [8] = "FFFFFFFF", -- White Skull
        }

        local dungeonMobNames = {

            -- Eco-Dome Al'dani
            [234870] = "Захватчик",
            [234918] = "Ползун",
            [234935] = "Переписчица",
            [234955] = "Хранитель",
            [234957] = "Ритуалист",
            [234960] = "Прыгуана",
            [234962] = "Дальноход",
            [245092] = "Землерой",

            -- Operation: Floodgate
            [226403] = "Киза",
            [226404] = "Гизл",
            [227145] = "Кроколиск",
            [228144] = "Солдат",
            [228424] = "Мехадрон",
            [229069] = "Снайпер",
            [229212] = "Подрывник",
            [229250] = "Подрядчик",
            [229251] = "Архитектор",
            [229252] = "Гиена",
            [229686] = "Геодезист",
            [230740] = "Крошшенатор",
            [230748] = "Кровоплет",
            [231014] = "Бот",
            [231197] = "Яяяяяяязь",
            [231312] = "Электрик",
            [231325] = "Запускатель",
            [231385] = "Инспектор",
            [231496] = "Ныряльщик",
            [231497] = "Краб",
            [232228] = "Донник",
            [236982] = "Солдат",

            -- Priory of the Sacred Flame
            [206698] = "Фанатичка",
            [206710] = "Огонек",
            [222927] = "Винодел",

            -- The Dawnbreaker
            [210966] = "Паук",
            [211087] = "Проповедница",
            [211089] = "Нубик",
            [211261] = "Виски",
            [211262] = "Искра",
            [211263] = "Кутак",
            [213885] = "Архитектор",
            [213892] = "Маг",
            [213893] = "Заклинатель",
            [213895] = "Странник",
            [213932] = "Ополченец",
            [213937] = "Рошан",
            [223994] = "Маг",
            [225479] = "Паук",
            [225605] = "Заклинатель",
            [225606] = "Странник",
            [228540] = "Маг",
            [228537] = "Странник",
            [228539] = "Заклинатель",
            
            -- Ara-Kara, City of Echoes
            [216293] = "Щелкун",
            [216340] = "Дозорный",
            [216341] = "Пронзатель",
            [218325] = "Роевик",
            [220599] = "Маг",
            [223253] = "Маг",

            -- Halls of Atonement
            [164218] = "Лорд",
            [164557] = "Фрагмент",
            [167607] = "Рассекатель",
            [167611] = "Потрошительница",
            [167612] = "Разоритель",
            [167876] = "Инквизитор",
            [167898] = "Воплощение",
            [174175] = "Горгулья",

            -- Tazavesh: So'leah's Gambit
            [175546] = "Кэп",
            [176551] = "Очиститель",
            [177500] = "Громила",
            [177716] = "Убийца",
            [178133] = "Волнопляс",
            [178139] = "Крушитель",
            [178141] = "Тотемщик",
            [178142] = "Кастер",
            [178163] = "Бегун",
            [178165] = "Голиаф",
            [179386] = "Офицер",
            [179388] = "Заклинатель",

            -- Tazavesh: Streets of Wonder
            [175576] = "Камера",
            [175646] = "Печкин",
            [176394] = "Служащий",
            [176395] = "Элем",
            [176555] = "Ахиллит",
            [177237] = "Цепи",
            [177807] = "Охранник",
            [177816] = "Специалист",
            [177817] = "Офицер",
            [178392] = "Страж",
            [178394] = "Прислужник",
            [179269] = "Охранник",
            [179837] = "Следопыт",
            [179840] = "Хранитель",
            [179841] = "Заклинатель",
            [179842] = "Охранник",
            [180091] = "Гончая",
            [180335] = "Контрабандист",
            [180336] = "Авторитет",
            [180348] = "Громила",
            [180567] = "Кошка",
        }

        function envTable.rename(npcId, unitId)
            if unitId then
                local name = UnitName(unitId)
                local a, b, c, d, e, f = strsplit(' ', name, 5)

                local unitName

                if dungeonMobNames[npcId] then
                    unitName = dungeonMobNames[npcId]
                else
                    unitName = name ~=nil and (f or e or d or c or b or a) or nil
                end

                if unitName == nil then
                    unitName = name
                end

                -- Capitalize first word
                unitName = unitName:utf8sub(1,1):upper()..unitName:utf8sub(2)

                local marker = GetRaidTargetIndex(unitId)
                if unitId and marker == nil then
                    marker = 8
                end

                if unitId and marker then
                    unitFrame.healthBar.unitName:SetText(WrapTextInColorCode(unitName, markerToHex[marker]))
                elseif unitId then
                    unitFrame.healthBar.unitName:SetText(unitName)
                end
            end
        end
    end

