
CameraTiltControlsDB = {
["profileKeys"] = {
["Мальдика - Свежеватель Душ"] = "Default",
["Вантачмэн - Ревущий фьорд"] = "Default",
["Дракобес - Свежеватель Душ"] = "Default",
["Сэйвмэн - Свежеватель Душ"] = "Default",
["Вольтчара - Свежеватель Душ"] = "Default",
["Прециза - Свежеватель Душ"] = "Default",
["Топмэн - Свежеватель Душ"] = "Default",
["Алианкано - Свежеватель Душ"] = "Default",
["Джуставар - Свежеватель Душ"] = "Default",
["Сорчистино - Свежеватель Душ"] = "Default",
["Виандисто - Свежеватель Душ"] = "Default",
["Бимладен - Ревущий фьорд"] = "All classes",
["Спленда - Свежеватель Душ"] = "Default",
},
["profiles"] = {
["Default"] = {
},
["All classes"] = {
["topDownStrength"] = 0.3,
},
},
}
