
HandyNotes_WarWithinDB = {
["profileKeys"] = {
["Мальдика - Свежеватель Душ"] = "Мальдика - Свежеватель Душ",
["Вантачмэн - Ревущий фьорд"] = "Вантачмэн - Ревущий фьорд",
["Дракобес - Свежеватель Душ"] = "Дракобес - Свежеватель Душ",
["Сэйвмэн - Свежеватель Душ"] = "Сэйвмэн - Свежеватель Душ",
["Вольтчара - Свежеватель Душ"] = "Вольтчара - Свежеватель Душ",
["Спленда - Свежеватель Душ"] = "Спленда - Свежеватель Душ",
["Сорчистино - Свежеватель Душ"] = "Сорчистино - Свежеватель Душ",
["Алианкано - Свежеватель Душ"] = "Алианкано - Свежеватель Душ",
["Джуставар - Свежеватель Душ"] = "Джуставар - Свежеватель Душ",
["Топмэн - Свежеватель Душ"] = "Топмэн - Свежеватель Душ",
["Виандисто - Свежеватель Душ"] = "Виандисто - Свежеватель Душ",
["Бимладен - Ревущий фьорд"] = "Бимладен - Ревущий фьорд",
["Прециза - Свежеватель Душ"] = "Прециза - Свежеватель Душ",
},
["profiles"] = {
["Мальдика - Свежеватель Душ"] = {
},
["Вантачмэн - Ревущий фьорд"] = {
},
["Дракобес - Свежеватель Душ"] = {
},
["Сэйвмэн - Свежеватель Душ"] = {
},
["Вольтчара - Свежеватель Душ"] = {
},
["Спленда - Свежеватель Душ"] = {
},
["Сорчистино - Свежеватель Душ"] = {
},
["Алианкано - Свежеватель Душ"] = {
},
["Джуставар - Свежеватель Душ"] = {
},
["Топмэн - Свежеватель Душ"] = {
},
["Виандисто - Свежеватель Душ"] = {
},
["Бимладен - Ревущий фьорд"] = {
},
["Прециза - Свежеватель Душ"] = {
},
},
}
