
HandyNotesDB = {
["profileKeys"] = {
["Бимладен - Ревущий фьорд"] = "Бимладен - Ревущий фьорд",
["Сорчистино - Свежеватель Душ"] = "Сорчистино - Свежеватель Душ",
},
["profiles"] = {
["Бимладен - Ревущий фьорд"] = {
},
["Сорчистино - Свежеватель Душ"] = {
},
},
}
HandyNotes_HandyNotesDB = {
["profileKeys"] = {
["Бимладен - Ревущий фьорд"] = "Бимладен - Ревущий фьорд",
["Сорчистино - Свежеватель Душ"] = "Сорчистино - Свежеватель Душ",
},
["profiles"] = {
["Бимладен - Ревущий фьорд"] = {
},
["Сорчистино - Свежеватель Душ"] = {
},
},
}
