
MythicDungeonToolsDB = {
["profileKeys"] = {
["Мальдика - Свежеватель Душ"] = "Мальдика - Свежеватель Душ",
["Вантачмэн - Ревущий фьорд"] = "Вантачмэн - Ревущий фьорд",
["Дракобес - Свежеватель Душ"] = "Дракобес - Свежеватель Душ",
["Сэйвмэн - Свежеватель Душ"] = "Сэйвмэн - Свежеватель Душ",
["Вольтчара - Свежеватель Душ"] = "Вольтчара - Свежеватель Душ",
["Прециза - Свежеватель Душ"] = "Прециза - Свежеватель Душ",
["Топмэн - Свежеватель Душ"] = "Топмэн - Свежеватель Душ",
["Алианкано - Свежеватель Душ"] = "Алианкано - Свежеватель Душ",
["Джуставар - Свежеватель Душ"] = "Джуставар - Свежеватель Душ",
["Сорчистино - Свежеватель Душ"] = "Сорчистино - Свежеватель Душ",
["Виандисто - Свежеватель Душ"] = "Виандисто - Свежеватель Душ",
["Бимладен - Ревущий фьорд"] = "Бимладен - Ревущий фьорд",
["Спленда - Свежеватель Душ"] = "Спленда - Свежеватель Душ",
},
["global"] = {
["latestDungeonSeen"] = 150,
["minimap"] = {
["showInCompartment"] = true,
["hide"] = true,
},
["maximized"] = false,
["presets"] = {
[150] = {
{
["difficulty"] = 10,
["week"] = 1,
["value"] = {
["currentPull"] = 1,
["currentSublevel"] = 1,
["currentDungeonIdx"] = 150,
["selection"] = {
1,
},
["pulls"] = {
{
["color"] = "ff3eff",
},
},
},
},
},
},
["prePatchWarningSeenFor"] = 1768950035,
["version"] = 607,
["scale"] = 1.4,
},
}
