
SimulationCraftDB = {
["profileKeys"] = {
["Сорчистино - Свежеватель Душ"] = "Сорчистино - Свежеватель Душ",
["Вольтчара - Свежеватель Душ"] = "Вольтчара - Свежеватель Душ",
["Бимладен - Ревущий фьорд"] = "Бимладен - Ревущий фьорд",
["Мальдика - Свежеватель Душ"] = "Мальдика - Свежеватель Душ",
},
["profiles"] = {
["Сорчистино - Свежеватель Душ"] = {
},
["Вольтчара - Свежеватель Душ"] = {
},
["Бимладен - Ревущий фьорд"] = {
["minimap"] = {
["hide"] = true,
},
},
["Мальдика - Свежеватель Душ"] = {
["minimap"] = {
["hide"] = true,
},
},
},
}
